// Task 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее

/*Console.Write("Input first number ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number ");
int num2 = Convert.ToInt32(Console.ReadLine());

if (num1 > num2) {
    Console.Write(num1 + " Bigger then " + num2);
}   else {
    Console.Write(num2 + " Bigger then " + num1);
}
*/